xdu-aero-association/FM33LC0XX_Example_0.04/CRC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rtc.h
/**
  * @brief    
  * @rmtoll   BCDDAY        LL_RTC_GetDaysReg
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetDaysReg(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDDAY, 0x3fU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   BCDDAY        LL_RTC_SetDaysReg
  * @param    RTCx RTC instance
  * @param    DayVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetDaysReg(RTC_Type* RTCx, uint32_t DayVel)
{
    MODIFY_REG(RTCx->BCDDAY, (0x3fU << 0U), (DayVel << 0U));
}

/**
  * @brief    
  * @rmtoll   BCDWEEK        LL_RTC_GetWeeksReg
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetWeeksReg(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDWEEK, 0x7U) >> 0U);
}

/**
  * @brief    
  * @rmtoll   BCDWEEK        LL_RTC_SetWeeksReg
  * @param    RTCx RTC instance
  * @param    WeekVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetWeeksReg(RTC_Type* RTCx, uint32_t WeekVel)
{
    MODIFY_REG(RTCx->BCDWEEK, (0x7U << 0U), (WeekVel << 0U));
}

/**
  * @brief    
  * @rmtoll   BCDMONTH        LL_RTC_GetMonthReg
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetMonthReg(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDMONTH, 0x1fU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   BCDMONTH        LL_RTC_SetMonthReg
  * @param    RTCx RTC instance
  * @param    MonVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetMonthReg(RTC_Type* RTCx, uint32_t MonVel)
{
    MODIFY_REG(RTCx->BCDMONTH, (0x1fU << 0U), (MonVel << 0U));
}

/**
  * @brief    
  * @rmtoll   BCDYEAR        LL_RTC_GetYearsReg
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetYearsReg(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->BCDYEAR, 0xffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   BCDYEAR        LL_RTC_SetYearsReg
  * @param    RTCx RTC instance
  * @param    YearVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetYearsReg(RTC_Type* RTCx, uint32_t YearVel)
{
    MODIFY_REG(RTCx->BCDYEAR, (0xffU << 0U), (YearVel << 0U));
}

/**
  * @brief    
  * @rmtoll   ALARM        LL_RTC_GetHours_Alarm
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetHours_Alarm(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ALARM, 0x3fU) >> 16U);
}

/**
  * @brief    
  * @rmtoll   ALARM        LL_RTC_SetHours_Alarm
  * @param    RTCx RTC instance
  * @param    HourVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetHours_Alarm(RTC_Type* RTCx, uint32_t HourVel)
{
    MODIFY_REG(RTCx->ALARM, (0x3fU << 16U), (HourVel << 16U));
}

/**
  * @brief    
  * @rmtoll   ALARM        LL_RTC_GetMinutes_Alarm
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetMinutes_Alarm(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ALARM, 0x7fU) >> 8U);
}

/**
  * @brief    
  * @rmtoll   ALARM        LL_RTC_SetMinutes_Alarm
  * @param    RTCx RTC instance
  * @param    MinVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetMinutes_Alarm(RTC_Type* RTCx, uint32_t MinVel)
{
    MODIFY_REG(RTCx->ALARM, (0x7fU << 8U), (MinVel << 8U));
}

/**
  * @brief    
  * @rmtoll   ALARM        LL_RTC_GetSecond_Alarm
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetSecond_Alarm(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ALARM, 0x7fU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ALARM        LL_RTC_SetSecond_Alarm
  * @param    RTCx RTC instance
  * @param    SecVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetSecond_Alarm(RTC_Type* RTCx, uint32_t SecVel)
{
    MODIFY_REG(RTCx->ALARM, (0x7fU << 0U), (SecVel << 0U));
}

/**
  * @brief    
  * @rmtoll   TMSEL    TMSEL    LL_RTC_SetTimeMark
  * @param    RTCx RTC instance
  * @param    MarkSelect This parameter can be one of the following values:
  *           @arg @ref LL_RTC_TIME_MARK_SECOND
  *           @arg @ref LL_RTC_TIME_MARK_MINUTE
  *           @arg @ref LL_RTC_TIME_MARK_HOUR
  *           @arg @ref LL_RTC_TIME_MARK_DAY
  *           @arg @ref LL_RTC_TIME_MARK_ALARM
  *           @arg @ref LL_RTC_TIME_MARK_32_SEC
  *           @arg @ref LL_RTC_TIME_MARK_SECOND_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_MINUTE_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_HOUR_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_DAY_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_ALARM_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_SEC
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetTimeMark(RTC_Type* RTCx, uint32_t MarkSelect)
{
    MODIFY_REG(RTCx->TMSEL, RTC_TMSEL_TMSEL_Msk, MarkSelect);
}

/**
  * @brief    
  * @rmtoll   TMSEL    TMSEL    LL_RTC_GetTimeMark
  * @param    RTCx RTC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RTC_TIME_MARK_SECOND
  *           @arg @ref LL_RTC_TIME_MARK_MINUTE
  *           @arg @ref LL_RTC_TIME_MARK_HOUR
  *           @arg @ref LL_RTC_TIME_MARK_DAY
  *           @arg @ref LL_RTC_TIME_MARK_ALARM
  *           @arg @ref LL_RTC_TIME_MARK_32_SEC
  *           @arg @ref LL_RTC_TIME_MARK_SECOND_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_MINUTE_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_HOUR_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_DAY_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_ALARM_REVERSE
  *           @arg @ref LL_RTC_TIME_MARK_SEC
  */
__STATIC_INLINE uint32_t LL_RTC_GetTimeMark(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->TMSEL, RTC_TMSEL_TMSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ADJUST        LL_RTC_GetAdjustVel
  * @param    RTCx RTC instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetAdjustVel(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ADJUST, 0x1ffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ADJUST        LL_RTC_SetAdjustVel
  * @param    RTCx RTC instance
  * @param    AdjustVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetAdjustVel(RTC_Type* RTCx, uint32_t AdjustVel)
{
    MODIFY_REG(RTCx->ADJUST, (0x1ffU << 0U), (AdjustVel << 0U));
}

/**
  * @brief    
  * @rmtoll   ADSIGN    ADSIGN    LL_RTC_SetAdjustDirect
  * @param    RTCx RTC instance
  * @param    AdjustDirect This parameter can be one of the following values:
  *           @arg @ref LL_RTC_ADJUST_DIR_INCREASE
  *           @arg @ref LL_RTC_ADJUST_DIR_REDUCE
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetAdjustDirect(RTC_Type* RTCx, uint32_t AdjustDirect)
{
    MODIFY_REG(RTCx->ADSIGN, RTC_ADSIGN_ADSIGN_Msk, AdjustDirect);
}

/**
  * @brief    
  * @rmtoll   ADSIGN    ADSIGN    LL_RTC_GetAdjustDirect
  * @param    RTCx RTC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_RTC_ADJUST_DIR_INCREASE
  *           @arg @ref LL_RTC_ADJUST_DIR_REDUCE
  */
__STATIC_INLINE uint32_t LL_RTC_GetAdjustDirect(RTC_Type* RTCx)
{
    return (uint32_t)(READ_BIT(RTCx->ADSIGN, RTC_ADSIGN_ADSIGN_Msk));
}

/**
  * @brief    
  * @rmtoll   SBSCNT        LL_RTC_SetMilliSecondsReg
  * @param    RTCx RTC instance
  * @param    MilliSecVel 
  * @retval   None
  */
__STATIC_INLINE void LL_RTC_SetMilliSecondsReg(RTC_Type* RTCx, uint32_t MilliSecVel)
{
    MODIFY_REG(RTCx->SBSCNT, (0x1ffU << 0U), (MilliSecVel << 0U));
}

/**
  * @brief    
  * @rmtoll   BACKUP        LL_RTC_GetBackupReg
  * @param    RTCx RTC instance
  * @param    Backnum This parameter can be one of the following values:
  *           @arg @ref LL_RTC_BACKUP_0
  *           @arg @ref LL_RTC_BACKUP_1
  *           @arg @ref LL_RTC_BACKUP_2
  *           @arg @ref LL_RTC_BACKUP_3
  *           @arg @ref LL_RTC_BACKUP_4
  *           @arg @ref LL_RTC_BACKUP_5
  *           @arg @ref LL_RTC_BACKUP_6
  *           @arg @ref LL_RTC_BACKUP_7
  * @retval   
  */
__STATIC_INLINE uint32_t LL_RTC_GetBackupReg(RTC_Type* RTCx, uint32_t Backnum)
{
    Backup_ADDR  *addr = (Backup_ADDR*)RTCx->BKR0;
    
