xdu-aero-association/FM33LC0XX_Example_0.04/CRC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_rtc.h
    return (uint32_t)(READ_BIT(addr->Backup[Backnum], 0xFFFFFFFFu)); 
}

/**
  * @brief    
  * @rmtoll   BACKUP        LL_RTC_SetBackupReg
  * @param    RTCx RTC instance
  * @param    BackupVel 
  * @param    Backnum This parameter can be one of the following values:
  *           @arg @ref LL_RTC_BACKUP_0
  *           @arg @ref LL_RTC_BACKUP_1
  *           @arg @ref LL_RTC_BACKUP_2
  *           @arg @ref LL_RTC_BACKUP_3
  *           @arg @ref LL_RTC_BACKUP_4
  *           @arg @ref LL_RTC_BACKUP_5
  *           @arg @ref LL_RTC_BACKUP_6
  *           @arg @ref LL_RTC_BACKUP_7
  * @retval   
  */ 
__STATIC_INLINE void LL_RTC_SetBackupReg(RTC_Type* RTCx, uint32_t BackupVel, uint32_t Backnum)
{   
    Backup_ADDR  *addr = (Backup_ADDR*)RTCx->BKR0;
    MODIFY_REG(addr->Backup[Backnum], (0xFFFFFFFFu),BackupVel );
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_RTC_DeInit(RTC_Type *RTCx);
void LL_RTC_StructInit(LL_RTC_InitTypeDef *InitStruct);
ErrorStatus LL_RTC_GetTime(RTC_Type *RTCx,LL_RTC_InitTypeDef *InitStruct);
ErrorStatus LL_RTC_Init(RTC_Type *RTCx, LL_RTC_InitTypeDef *TIM_InitStruct);
ErrorStatus LL_RTC_ConfigTime(RTC_Type *RTCx,LL_RTC_InitTypeDef *TIM_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_RTC_H*/

/***************************Py_Code_Generator Version: 0.1-0.5- @ 2019-11-07***************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
